import React from "react";
import Editor from "./_component/mainSection";
import SideBarBlog from "./_component/_sidebarSecion/layout";

const editorData = {
  time: 1727341563389,
  blocks: [
    {
      id: "ooMAe97ROw",
      data: {
        text: "فیلبند",
        level: 1,
      },
      type: "header",
    },
    {
      id: "uy56Z2K7FC",
      data: {
        text: "منصور ضابطیان: هفت صبح وقتی که هنوز آفتاب کم‌رمقه از خواب بیدار می‌شم، می‌رم لب پنجره، پنجره‌ای که رو به دریاست، پنجره رو باز می‌کنم و ریه‌هامو پر می‌کنم از هوای تازه صبح. بعد می‌زنم بیرون، به نظرم توی سفر صبحونه رو نباید توی هتل خورد، باید زد به شهر و شهر رو تجربه کرد، می‌رم توی کافه محلی می‌شینم و گوش می‌دم به صداها، خنده‌ها، به حرفها، مقصدم رو پیدا می‌کنم، یه کوچه، یه خیابون، یه میدون، یه جایی که بشه توش گم شد، اونقدر می‌رم می‌چرخم و می‌گردم و با آدما حرف می‌زنم که آروم آروم وقت ناهار می‌شه، برای یه آدم شکمویی مثل من، وقت ناهار توی سفر بهترین وقته. ناهار رو تجربه می‌کنم، تجربه‌ای از جنس همون شهر و بعد خودم رو به یه استراحت کوتاه مهمون می‌کنم. امشب مهمون یکی از مردم این شهرم. سر راه می‌رم توی کتابفروشی و حسابی کتابگردی می‌کنم، بعد گوش می‌سپرم به صدای شهر، هر شهری یه صدایی داره و این صدا باعث می‌شه که شهر در من دم بکشه. همه سفرها در من اینجوری شروع می‌شه، اول خیالش رو می‌کنم، بعد سفر می‌کنم… .",
        alignment: "justify",
      },
      type: "paragraph",
    },
    {
      id: "1jbLnO1a8s",
      data: {
        text: "گپ‌وگفت با دبیر اجرایی مسابقه سفرنامه‌نویسی علی‌بابا",
        level: 3,
      },
      type: "header",
    },
    {
      id: "svHTP-hknk",
      data: {
        text: "سولماز: بابک چطورایی؟ خوش اومدی! بابک: سلام سولماز. خوبم، قربونت. خیلی ممنون که منو به خونتون راه دادین. سولماز: نفرمایین آقا، منزل خودتونه! حالا ایشالا که دست پر اومده باشی! بابک: آره آره نگران نباش، دست خالی نیستم. سولماز: خب مارکو! برایمان چه آورده‌ای؟ تعریف کن ببینم، از این مسابقه سفرنامه‌نویسی چه خبر؟ بابک: (توضیحات مسابقه)\n سولماز: خب پس می‌شه گفت کسایی که دوست دارن تو این مسابقه شرکت کنن، هنوز\n یه ماهی وقت دارن که براتون سفرنامه یا خاطره‌ای که از سفر دارن رو \nبفرستن. بابک: آره، حتما. من پیشنهاد می‌کنم هرکسی که داره این اپیزود \nرو می‌شنوه، دست به قلم بشه و حتی شده تو بخش خاطره سفر شرکت کنه. اینجوری \nهم بالاخره شانسش رو برای بردن جایزه امتحان می‌کنه، هم واقعا مرور سفر و \nنوشتن از خاطرات سفر خیلی خیلی شیرینه. سولماز: بابک راستش خیلیا ممکنه\n از سفرنامه، نثرای سنگینی مثل سفرنامه‌های ناصرخسرو تو ذهنشون باشه. البته\n که نمونه‌های روون و خوبی مثل سفرنامه‌های آقای ضابطیان یا آقای رضا \nامیرخانی هستن که واقعا ترس نوشتن رو تو دل آدم می‌شکنن. ساده، روون و \nشیرین. با این حال اگر تو این مدت کاری به دستتون رسیده که در عین سادگی، \nقصه و روایت جذابی داره، خوبه که یه بخشاییش رو بشنویم. بابک: خیلی \nموافقم. اتفاقا دوتا خوبش رو جدا کردم و با خودم آوردم. پس اگه موافق باشی \nیکیش رو من بخونم، یکی دیگه‌اشم تو زحمتش رو بکشی. سولماز: عالی، چرا که نه.",
        alignment: "justify",
      },
      type: "paragraph",
    },
  ],
  version: "2.30.6",
};

const App: React.FC = () => {
  return (
    <div className="flex flex-row  overflow-y-scroll">
      <div className=" h-screen w-3/4">
        <Editor data={editorData} />
        
      </div>
      <div className=" w-1/4 h-screen ">
        <SideBarBlog />
      </div>
    </div>
  );
};

export default App;
